Revit 2027 API
BuiltInFailures.ScheduleViewFailures.PanelScheduleLoadClassInconsistency Property
 You have one or more loads connected to this panel that are not displayed in the panel schedule. Add the load classification(s) to the associated template to report this information in the Loads Summary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelScheduleLoadClassInconsistency { get; }
Public Shared ReadOnly Property PanelScheduleLoadClassInconsistency As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelScheduleLoadClassInconsistency {
	FailureDefinitionId^ get ();
}
static member PanelScheduleLoadClassInconsistency : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace